app/views/static_pages/help.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."key" = 'ajuda_log' LIMIT 1
---
	<% if signed_in? %>
	  <%= textilize Page.find_by_key(t(:help_page_log)).value if Page.find_by_key(t(:help_page_log)).value.present?%>