app/views/static_pages/home.html.erb

    <div>
      <% if @f.present? && current_user.show_fact? %>
---
SELECT "facts".* FROM "facts" WHERE (ini_term < '2014-11-13 21:34:41' AND fin_term > '2014-11-13 21:34:41' AND active = 't') ORDER BY facts.created_at ASC LIMIT 1

    <blockquote class="pull-right">
      <%= textilize Page.find_by_key(t(:phrase)).value if (Page.find_by_key(t(:phrase)).value.present?) %>
---
SELECT "pages".* FROM "pages" WHERE "pages"."key" = 'frase' LIMIT 1