app/views/sandargs/index.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."key" = 'referencias' LIMIT 1
---
          <hr/>
          <%= textilize Page.find_by_key(t(:intro_guide)).value if Page.find_by_key(t(:intro_guide)).value.present? %>