app/views/schemes/index.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."key" = 'fonte_esq' LIMIT 1
---
		</div>
		<%= textilize Page.find_by_key('fonte_esq').value if Page.find_by_key('fonte_esq').value.present? %>