app/views/arguments/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY users.name ASC LIMIT 1
---
				<% end %>
				<span class="timestamp"> <%= t(:created_by) %> <a href="users/<%= argument.user_id %>"><%= User.find_by_id(argument.user_id).name %></a> - <%= time_ago_in_words(argument.created_at) %> </span>