app/views/arguments/show.html.erb

SELECT "arguments".* FROM "arguments" WHERE "arguments"."id" = ? ORDER BY arguments.created_at DESC LIMIT 1  [["id", "61"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY users.name ASC LIMIT 1
---
<% provide(:title, t('title_argument', user: "#{User.find_by_id(@argument.user_id).name}")) %>