app/views/users/show.html.erb

	<div class="span8">
		<% if @user.arguments.any? %>
---
SELECT COUNT(*) FROM "arguments" WHERE "arguments"."user_id" = 2