app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "arguments" WHERE "arguments"."user_id" = 1
---
<span>
  <%= pluralize(current_user.arguments.count, t('activerecord.models.argument.one')) %>