app/controllers/arguments_controller.rb

SELECT "arguments".* FROM "arguments" WHERE "arguments"."id" = ? ORDER BY arguments.created_at DESC LIMIT 1  [["id", "61"]]
---
  def show
    @argument = Argument.find(params[:id])

SELECT "arguments".* FROM "arguments" ORDER BY arguments.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "arguments" WHERE (LOWER(content) LIKE '%amor%')
---
  def index
    @arguments = Argument.search(params[:search]).paginate(:per_page => 30, :page => params[:page])

INSERT INTO "arguments" ("content", "created_at", "fact_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "teste"], ["created_at", Sat, 26 Jul 2014 14:02:11 UTC +00:00], ["fact_id", nil], ["updated_at", Sat, 26 Jul 2014 14:02:11 UTC +00:00], ["user_id", 1]]
---
  def create
    @argument = current_user.arguments.build(params[:argument])
    if @argument.save