app/controllers/facts_controller.rb

  def index
    @facts = Fact.where("ini_term < ? AND active = ?", DateTime.now, true)
---
SELECT "facts".* FROM "facts" WHERE (ini_term > '2014-07-26 14:02:15' OR ini_term IS NULL OR active = 'f') ORDER BY facts.created_at DESC

  def show
    @fact  = Fact.find(params[:id])
    if not @fact.active
      redirect_to(facts_path) unless current_user.admin?
    end
    @argument  = current_user.arguments.build

    @arguments_in = Argument.where("fact_id = ? AND created_at < ?", @fact.id, @fact.fin_term)
---
SELECT "facts".* FROM "facts" WHERE "facts"."id" = ? ORDER BY facts.created_at DESC LIMIT 1  [["id", "2"]]
SELECT "arguments".* FROM "arguments" WHERE (fact_id = 2 AND created_at > '2014-05-08 22:15:00.000000') ORDER BY arguments.created_at DESC

  def edit
    @fact  = Fact.find(params[:id])
---
SELECT "facts".* FROM "facts" WHERE "facts"."id" = ? ORDER BY facts.created_at DESC LIMIT 1  [["id", "4"]]

  def update
    @fact = Fact.find(params[:id])
    if @fact.update_attributes(params[:fact])
---
SELECT "facts".* FROM "facts" WHERE "facts"."id" = ? ORDER BY facts.created_at DESC LIMIT 1  [["id", "4"]]
UPDATE "facts" SET "orientation" = '', "ini_term" = '2014-11-01 21:15:00.000000', "fin_term" = '2014-11-30 21:15:00.000000', "updated_at" = '2014-11-13 21:24:04.157048' WHERE "facts"."id" = 4