app/controllers/msgs_controller.rb

SELECT "users".* FROM "users" ORDER BY users.name ASC
---
  def index
    @msgs = Msg.where("id_receiver = ? OR user_id = ?", current_user.id, current_user.id)
    @msg  = current_user.msgs.build

    @users = User.all