app/controllers/schemes_controller.rb

  def edit
    @scheme = Scheme.find(params[:id])
---
SELECT "schemes".* FROM "schemes" WHERE "schemes"."id" = ? ORDER BY schemes.name ASC LIMIT 1  [["id", "1"]]

  def index
    #filtrar por locale
    @schemes = Scheme.search(params[:search]).paginate(:per_page => 30, :page => params[:page])
---
SELECT "schemes".* FROM "schemes" ORDER BY schemes.name ASC, schemes.lang DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "schemes"