app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'nailtongomes@ig.com.br' ORDER BY users.name ASC LIMIT 1
---
 def create
    user = User.find_by_email(params[:session][:email])