app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY users.name ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY users.name ASC LIMIT 1  [["id", "1"]]
SELECT "arguments".* FROM "arguments" WHERE "arguments"."user_id" = 1 ORDER BY arguments.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "arguments" WHERE "arguments"."user_id" = 1
---
  def show
    @user = User.find(params[:id])
    @arguments = @user.arguments.paginate(page: params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY users.name ASC LIMIT 1  [["id", "1"]]
---
  def followers
    @title = t(:followers)
    @user = User.find(params[:id])